[{
        "name": "Thorin Oakenshield",
        "description": "Thorin II, also called the Oakenshield, King under the Mountain or the Mountain King, was the son of Thráin II, the older brother of Frerin and Dís, the grandson of King Thrór and the uncle of Fíli and Kíli. Thorin was best known for his deeds as leader of a company that infiltrated the lost Kingdom under the Mountain to take it back from Smaug and for leading an alliance of Men, Dwarves, and Elves in the Battle of the Five Armies.",
        "image_source": "http://www.panhistoria.com/Stacks/Novels/characterimages/T27293.jpg"
    },
    {
        "name": "Kili & Fili",
        "description": "Fíli and Kíli were the two most active dwarves of Thorin's company, and apart from Balin, and possibly Bombur, they appeared more frequently as 'individual' characters in Tolkien's novel than the rest of Thorin's companions, who were most often named only in 'group' references to the entire company.",
        "image_source": "http://www.filmofilia.com/wp-content/uploads/2011/07/hobbit_0.jpg"
    },

    {
        "name": "Oin & Gloin",
        "description": "Glóin was born in TA 2783, after the dragon Smaug desolated Erebor. He was the younger child of Gróin and younger brother of Óin. In TA 2799, Glóin was known to have fought in the Battle of Azanulbizar, the last battle of the War of the Dwarves and Orcs, though it is unknown how significant his contribution was, being 16 years old. In TA 2879, in the Blue Mountains, while in exile, his son Gimli was born to him and an unknown wife. In March of TA 2941 in Bree, Thorin Oakenshield met by chance the wizard Gandalf the Grey, pushing Thorin to reclaim Erebor, so that Smaug wouldn't ally with Sauron. When Gandalf mentioned Hobbits, Glóin referred them as 'simpletons' and also said that Hobbits 'would never dare to come within smelling distance of the nakedest dragonet new from the shell'. Óin was the older brother of Glóin, cousin of Dwalin and Balin, and uncle of Gimli. Óin's uncle was Fundin, the father of Balin and Dwalin. He usually wore a brown-hooded cloak when travelling. Óin fought in the Battle of Azanulbizar along with Thorin Oakenshield, and in TA 2941 joined with Thorin and Company on the quest to reclaim the Lonely Mountain wearing a brown hood.[2] Óin was one of the Dwarves who bet that Bilbo would come along with them to reclaim the Lonely Mountain. Óin and his brother Glóin were usually in charge of preparing the fire for the Company as they were the most skilled out of the others. He fought in and survived the Battle of Five Armies, and later settled in the Lonely Mountain with King Dáin II Ironfoot, along with many other Dwarves of The Company of Thorin.",
        "image_source": "https://external-preview.redd.it/t6kOi6D8hICqAevkQ-RWqm6o0u2HbpGhYhpZSjBO5cA.jpg?auto=webp&s=e707c95aa43836015901799ef5801f7bba10e0de"
    },
    {
        "name": "Balin & Dwalin",
        "description": "Balin was likely born in the Lonely Mountain before the coming of the dragon Smaug. He had a younger brother named Dwalin, and was amongst those driven from their homes when Smaug attacked the Lonely Mountain. Afterwards, he may have lived in Dunland as a refugee, before fighting in the War of the Dwarves and Orcs which culminated in the Battle of Azanulbizar. Many years later, in approximately TA 2841, he accompanied Thráin II, the father of Thorin, when he attempted to go back to the Lonely Mountain himself, but Thráin was captured and lost.",
        "image_source": "https://www.comingsoon.net/assets/uploads/2011/07/file_79858_0_balindwalin.jpg"
    },
    {
        "name": "Ori, Dori & Nori",
        "description": "An unnamed woman started the family by marrying a first husband. Through their relationships, she had a son named Dori. The woman later married a second time, which resulted in their son, Nori. Then, she married a third and final time and had a son named Ori. Sometime later, their parents both pass away and Dori is left raising Nori and Ori on his own. However, Nori becomes a trouble maker by thieving or disobeying the law while Ori studied to become a scribe. The three brothers later joined Thorin's company in TA 2941 and also fought and survived in the battle of the Five Armies. While Nori and Dori stayed in their home at Erebor, Ori went with Oin, Balin and several other dwaarves before being killed in the battle in Moria.",
        "image_source": "https://atolkienistperspective.files.wordpress.com/2013/08/dno.jpg"
    },
    {
        "name": "Bifur, Bofur & Bombur",
        "description": "Bombur was a Dwarf who accompanied Thorin Oakenshield and Bilbo Baggins on their quest to the Lonely Mountain as part of the company, alongside his brother Bofur and cousin Bifur. Bombur was noted as the fattest Dwarf in the company.",
        "image_source": "https://atolkienistperspective.files.wordpress.com/2013/08/bbb.jpg"
    },
    {
        "name": "Gandalf",
        "description": "Gandalf the Grey, later known as Gandalf the White, and originally named Olórin (Quenya; IPA: [oˈloːrin]), was an Istar (Wizard), dispatched to Middle-earth in the Third Age to combat the threat of Sauron. He joined Thorin II Oakenshield and his company to reclaim the Lonely Mountain from Smaug, helped form the Fellowship of the Ring to destroy the One Ring, and led the Free Peoples in the final campaign of the War of the Ring. As a wizard and the bearer of one of the Three Rings, Gandalf has great power, but works mostly by encouraging and persuading. He sets out as Gandalf the Grey, possessing great knowledge, and travelling continually, always focused on the mission to counter the Dark Lord Sauron. He is associated with fire, his ring being Narya, the Ring of Fire, and he both delights in fireworks to entertain the hobbits of the Shire, and in great need uses fire as a weapon. As one of the Maiar he is an immortal spirit, but being in a physical body on Middle-earth, he can be killed in battle, as he is by the Balrog from Moria. He is sent back to Middle-earth to complete his mission, now as Gandalf the White and leader of the order of wizards.",
        "image_source": "https://wallpaperaccess.com/full/2870050.jpg"
    }
]